{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv1D", "config": {"name": "conv_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [64], "strides": [16], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_1", "inbound_nodes": [[["conv_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu_1", "inbound_nodes": [[["batch_1", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "pool_1", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_first"}, "name": "pool_1", "inbound_nodes": [[["relu_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2", "inbound_nodes": [[["pool_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_2", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_2", "inbound_nodes": [[["conv_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu_2", "inbound_nodes": [[["batch_2", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "pool_2", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_first"}, "name": "pool_2", "inbound_nodes": [[["relu_2", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_3", "inbound_nodes": [[["pool_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_3", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_3", "inbound_nodes": [[["conv_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu_3", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu_3", "inbound_nodes": [[["batch_3", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "pool_3", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_first"}, "name": "pool_3", "inbound_nodes": [[["relu_3", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv_4", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_4", "inbound_nodes": [[["pool_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_4", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_4", "inbound_nodes": [[["conv_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu_4", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu_4", "inbound_nodes": [[["batch_4", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "pool_4", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_first"}, "name": "pool_4", "inbound_nodes": [[["relu_4", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv_5", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_5", "inbound_nodes": [[["pool_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_5", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_5", "inbound_nodes": [[["conv_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu_5", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu_5", "inbound_nodes": [[["batch_5", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "pool_5", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_first"}, "name": "pool_5", "inbound_nodes": [[["relu_5", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["pool_5", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}